# Используем официальный образ Node.js для сборки React приложения
FROM node:14 AS build

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /

# Копируем package.json и package-lock.json в контейнер
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы из текущей директории в контейнер
COPY . .

# Выполняем команду сборки проекта
RUN npm run build

# Отдельный этап контейнера для Nginx
FROM nginx:alpine

# Копируем статические файлы сборки из предыдущего этапа в Nginx
COPY --from=build /build /usr/share/nginx/html

# По умолчанию Nginx слушает порт 80, так что не нужно дополнительной настройки

# Экспортируем порт 80 (HTTP)
EXPOSE 80

# Команда, которая будет выполняться при запуске контейнера
CMD ["nginx", "-g", "daemon off;"]
